module Vegetable

  def vegetable
    case @event_message
    when "vegetable"
      "野菜"
    when "にんじん" ,"人参","ニンジン"
      "人参(にんじん)　　１本　４１円　　３本　１０６円　　(税込  デリシア）"
    when "まいたけ","マイタケ","舞茸" 
      "舞茸(まいたけ)1袋　１０６円　　(税込　デリシア)"
    when"ブロッコリー","ぶろっこりー" 
      "１袋あたり、１６０円　　(税込　デリシア)　９８円　　(税込　バロー)　"
    when"きゅうり","キュウリ","胡瓜"
      "１本　５２円　　(税込　デリシア)"
    when"サツマイモ","さつまいも","薩摩芋"
      "１箱　１０００円　　(新鮮市場ききょう)"
    when"小松菜","こまつな","コマツナ"
      "1袋　１００円　　(新鮮市場ききょう)"
    when"たまねぎ","玉ねぎ","タマネギ","玉葱"
      "２個入り　２００円　　(新鮮市場ききょう)" 
    when"じゃがいも","ジャガイモ","じゃが芋"
      "約５００g　１００円　　(新鮮市場ききょう)"
    when"ほうれんそう","ホウレンソウ","ほうれん草","ホウレン草"
      "1袋あたり、　９８円　　(バロー)　　１０６円　（デリシア）"
    when"キャベツ","きゃべつ"
      "1玉あたり、　９８円　　(バロー)　　１３８円(デリシア)
    end
  end
end
