module Vegetable

  def vegetable
    case @event_message
    when "vegetable"
      "野菜"
    when "にんじん" ,"人参","ニンジン"
      "人参(にんじん)　　１本　４１円　　３本　１０６円　　(税込  デリシア）"
    when "まいたけ","マイタケ","舞茸" 
      "舞茸(まいたけ)1袋　１０６円　　(税込　デリシア)"
    when"ブッロコリー","ぶろっこりー" 
      "１６０円　　(税込　デリシア)　(税込　バロー)　"
    when"きゅうり","キュウリ","胡瓜"
      "１本　５２円　　(税込　デリシア)"
    when"サツマイモ","さつまいも","薩摩芋"
      "１箱　１０００円　　(新鮮市場ききょう)"
    when"小松菜","こまつな","コマツナ"
      "1袋　１００円　　(新鮮市場ききょう)"
    when"たまねぎ","玉ねぎ","タマネギ","玉葱"
      
    end
  end
end
